## **[MySQL INSERT](https://www.mysqltutorial.org/mysql-insert-statement.aspx)**

Use the MySQL INSERT statement to insert one or more rows into a table.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL INSERT statement

syntax:

INSERT INTO table(c1,c2,...)
VALUES (v1,v2,...);

INSERT INTO table(c1,c2,...)
VALUES 
   (v11,v12,...),
   (v21,v22,...),
    ...
   (vnn,vn2,...);

### MySQL INSERT examples

In [3]:
engine.execute('DROP TABLE IF EXISTS tasks')

string = '''
CREATE TABLE IF NOT EXISTS tasks (
    task_id INT AUTO_INCREMENT,
    title VARCHAR(255) NOT NULL,
    start_date DATE,
    due_date DATE,
    priority TINYINT NOT NULL DEFAULT 3,
    description TEXT,
    PRIMARY KEY (task_id)
);'''

engine.execute(string)

/tmp/ipykernel_30066/2655603224.py:1: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('DROP TABLE IF EXISTS tasks')

In [4]:
# equivalent to TINYINT in MySQL 
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

In [5]:
def change_type(df):
    df = df.assign(
        task_id = range(1, len(df)+1),
        title = df.title.astype('string').str[:255],
        start_date = df.start_date.astype('datetime64[ns]'),
        due_date = df.due_date.astype('datetime64[ns]'),
        priority = df.priority.fillna(3).astype(np.int8),
        description = df.description.astype('string'))
    return df

df2 = pd.DataFrame(
    data=None,
    columns=['task_id', 'title', 'start_date', 'due_date', 'priority', 'description'],
)

#### 1) MySQL INSERT – simple INSERT example

In [6]:
string = '''
INSERT INTO tasks (title, priority)
VALUES ('Learn MySQL INSERT Statement', 1)
;'''

engine.execute(string)

In [7]:
df1 = pd.read_sql('SELECT * FROM tasks', engine)

df1

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,None,None,1,None

In [8]:
row = {
    'title': ['Learn MySQL INSERT Statement'],
    'priority': [1],
}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(row)])
       .pipe(change_type))

df2

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,NaT,NaT,1,<NA>

#### 2) MySQL INSERT – Inserting rows using default value example

In [9]:
string = '''
INSERT INTO tasks (title, priority)
VALUES ('Understanding DEFAULT keyword in INSERT statement', DEFAULT)
;'''

engine.execute(string)

In [10]:
df1 = pd.read_sql('SELECT * FROM tasks', engine)
df1

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,None,None,1,None
1,2,Understanding DEFAULT keyword in INSERT statement,None,None,3,None

In [11]:
row = {'title': ['Understanding DEFAULT keyword in INSERT statement']}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(row)],
                 ignore_index=True)
       .pipe(change_type)
      )

df2

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,NaT,NaT,1,<NA>
1,2,Understanding DEFAULT keyword in INSERT statement,NaT,NaT,3,<NA>

#### 3) MySQL INSERT – Inserting dates into the table example

In [12]:
string = '''
INSERT INTO tasks (title, start_date, due_date)
VALUES ('Insert date into table', '2018-01-09', '2018-09-15')
;'''

engine.execute(string)

In [13]:
df1 = pd.read_sql('SELECT * FROM tasks', engine)
df1

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,None,None,1,None
1,2,Understanding DEFAULT keyword in INSERT statement,None,None,3,None
2,3,Insert date into table,2018-01-09,2018-09-15,3,None

In [14]:
row = {
    'title': ['Insert date into table'],
    'start_date': ['2018-01-09'],
    'due_date': ['2018-09-15'],
}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(row)],
                 ignore_index=True)
       .pipe(change_type))

df2

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,NaT,NaT,1,<NA>
1,2,Understanding DEFAULT keyword in INSERT statement,NaT,NaT,3,<NA>
2,3,Insert date into table,2018-01-09,2018-09-15,3,<NA>

In [15]:
string = '''
INSERT INTO tasks(title, start_date, due_date)
VALUES('Use current date for the task',
        CURRENT_DATE(), CURRENT_DATE())
;'''

engine.execute(string)

In [16]:
df1 = pd.read_sql('SELECT * FROM tasks', engine)
df1

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,None,None,1,None
1,2,Understanding DEFAULT keyword in INSERT statement,None,None,3,None
2,3,Insert date into table,2018-01-09,2018-09-15,3,None
3,4,Use current date for the task,2023-03-22,2023-03-22,3,None

In [17]:
row = {
    'title': ['Use current date for the task'],
    'start_date': [pd.to_datetime('today').date()],
    'due_date': [pd.to_datetime('today').date()],
}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(row)],
                 ignore_index=True)
       .pipe(change_type))

df2

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,NaT,NaT,1,<NA>
1,2,Understanding DEFAULT keyword in INSERT statement,NaT,NaT,3,<NA>
2,3,Insert date into table,2018-01-09,2018-09-15,3,<NA>
3,4,Use current date for the task,2023-03-22,2023-03-22,3,<NA>

#### 4) MySQL INSERT – Inserting multiple rows example

In [18]:
string = '''
INSERT INTO tasks(title, priority)
VALUES
    ('My first task', 1),
    ('It is the second task', 2),
    ('This is the third task of the week', 3)
;'''

engine.execute(string)

In [19]:
df1 = pd.read_sql('SELECT * FROM tasks', engine)
df1

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,None,None,1,None
1,2,Understanding DEFAULT keyword in INSERT statement,None,None,3,None
2,3,Insert date into table,2018-01-09,2018-09-15,3,None
3,4,Use current date for the task,2023-03-22,2023-03-22,3,None
4,5,My first task,None,None,1,None
5,6,It is the second task,None,None,2,None
6,7,This is the third task of the week,None,None,3,None

In [20]:
rows = {
    'title': ['My first task', 'It is the second task',
              'This is the third task'],
    'priority': [1, 2, 3],
}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(rows)],
                 ignore_index=True)
       .pipe(change_type))

df2

,task_id,title,start_date,due_date,priority,description
0,1,Learn MySQL INSERT Statement,NaT,NaT,1,<NA>
1,2,Understanding DEFAULT keyword in INSERT statement,NaT,NaT,3,<NA>
2,3,Insert date into table,2018-01-09,2018-09-15,3,<NA>
3,4,Use current date for the task,2023-03-22,2023-03-22,3,<NA>
4,5,My first task,NaT,NaT,1,<NA>
5,6,It is the second task,NaT,NaT,2,<NA>
6,7,This is the third task,NaT,NaT,3,<NA>

In [21]:
engine.execute('DROP TABLE IF EXISTS tasks')